


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
s1=int('436402')
s2=int('37800')
print(s1+s2)
# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
vsego = 375291
sklad3 = vsego-250449
sklad1 = vsego-222950
sklad2 = vsego-sklad1-sklad3
print('Склад_1', sklad1)
print('Склад_2', sklad2)
print('Склад_3', sklad3)
# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
srok=18
vznos=1179
print('Сумма кредита', vznos*srok)

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
del1=int(8019/8)
ostatok = 8019-del1*8
print('Для примера "а" остаток равен', ostatok)
del1=int(9097/9)
ostatok = 9097-del1*9
print('Для примера "b" остаток равен', ostatok)
del1=int(2789/5)
ostatok = 2789-del1*5
print('Для примера "c" остаток равен', ostatok)
del1=int(7248/6)
ostatok = 7248-del1*6
print('Для примера "d" остаток равен', ostatok)
del1=int(7128/5)
ostatok = 7128-del1*5
print('Для примера "e" остаток равен', ostatok)
del1=int(19224/9)
ostatok = 19224-del1*9
print('Для примера "f" остаток равен', ostatok)


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizzaV=4*274
pizzaS=2*218
Sok=4*35
tort=350
voda=3*21
Vsego=pizzaS+pizzaV+Sok+tort+voda
print(Vsego)

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
vsego_photo=232
photo_na_stran=8
vsego_stran=232/8
print(vsego_stran)

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
S=1600
bak=48
rashod=S/100*9
kol_zapravok=rashod//48
print(rashod)
print(kol_zapravok)